Revit 2027 API
FailureMessageAccessor.HasResolutions Method
 Checks if the failure has any resolutions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasResolutions()
Public Function HasResolutions As Boolean
public:
bool HasResolutions()
member HasResolutions : unit -> bool
Return Value
Boolean
 True if the failure has any resolutions, false otherwise.
Exceptions
Exception | Condition
InvalidOperationException |  This FailureMessageAccessor has not been properly initialized.
See Also
Reference
FailureMessageAccessor Class
Autodesk.Revit.DB Namespace